---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberNotJoined
source: html/17459bde-eba2-d87b-be07-fdb15a5f22d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberNotJoined Property

Both start and end of web must intersect the truss.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussUserDefinedMemberNotJoined { get; }
```